rsimulator-core/src/test/resources/test10/missing/WrongTagRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hel="http://www.github.com/bjuvensjo/rsimulator/SayHello/">
   <soapenv:Header/>
   <soapenv:Body>
      <hel:SayHelloRequest>
         <from>(.*)</from>
         <too>Hammarby</too>
         <inner>
            <greeting>.*</greeting>
            <code>10</code>
         </inner>
      </hel:SayHelloRequest>
   </soapenv:Body>
</soapenv:Envelope>